DEBUG:google.auth._default:Checking ./creds.json for explicit credentials as part of auth process...
INFO:__main__:user< help my code isn't working I need to implement a Boost Mobile Tire in Vero log 
INFO:__main__:duck> Boost Mobile Tire?
INFO:__main__:duck> Do you mean a binary tree?
INFO:__main__:user< 
INFO:__main__:user< multiplier 
INFO:__main__:duck> A multiplier?
INFO:__main__:duck> Do you mean a variable that stores a value to be multiplied by another value?
INFO:__main__:user< no 
INFO:__main__:duck> Okay, so you don't need a multiplier.
INFO:__main__:duck> Can you explain to me what you're trying to do?
INFO:__main__:user< I'm trying to multiply numbers in Vero log 
INFO:__main__:duck> Okay, so you want to multiply numbers in Verilog.
INFO:__main__:duck> Can you tell me what code you've written so far?
INFO:__main__:user< 
